test.yaml
---
execution:
- concurrency: 10
  ramp-up: 1m
  hold-for: 1m30s
  scenario: simple

scenarios:
  simple:
    script: bbc.jmx

modules:
  blazemeter:
          token: e3dd5d01729c20b7f3a8a57e:724dc2af980a8ae0839c28cc5a44b7cda27738a2384ab7c4211c74932663f414afa62413

reporting:
- module: console
- module: final-stats
  summary: true
  percentiles: true
  failed-labels: false
  test-duration: true
  dump-csv: TaurusResult/perf_result_csv.csv
- module: junit-xml
  data-source: pass-fail
  filename: TaurusResult/junit-result.xml
- module: blazemeter
  report-name: Elliad
  test: load-test
  project: load